<?php

$games=array("守望先锋"=>array("name"=>"守望先锋",
                "text"=>"《守望先锋》（Overwatch，简称OW） 是由暴雪娱乐公司开发的一款第一人称射击游戏，于2016年5月24日全球上市，中国大陆地区由网易公司代理。 
游戏以未来地球为背景，讲述人类、守望先锋成员和智能机械的恩怨纠葛。游戏现有28位英雄(截止到2018年7月25日)，每一位英雄都有各自标志性的武器和技能。守望先锋被解散后，在俄罗斯爆发了第二次智械危机，而以死神为首的“黑爪”组织追捕和杀害前守卫先锋成员和旨在维护人类与智能机械间和谐关系的人和机器人，黑爪侵入了温斯顿的基地，险些盗走关于前守望先锋成员的数据，在这种情况下，温斯顿不顾“佩特拉”法令而重新召集了守望先锋成员",
                 "img"=>"./img/img2",
                'baike'=>'https://baike.baidu.com/item/%E5%AE%88%E6%9C%9B%E5%85%88%E9%94%8B/16025868?fr=aladdin'),

    "风暴英雄"=>array("name"=>"风暴英雄",
                "text"=>"游戏中的英雄角色主要来自于暴雪四大经典游戏系列：《魔兽世界》、《暗黑破坏神》、《星际争霸》和《守望先锋》。它是一款道具收费的游戏，与《星际争霸Ⅱ》基于同一引擎开发。
该游戏最早在2010年的时候就被提及，当时游戏名为《暴雪DOTA》但因与\"Valve\"发生商标纠纷，庭外和解，因此。两公司达成了一条协议。暴雪因此更名为《暴雪全明星》。最终在2013年10月18日，暴雪正式更名为《风暴英雄》，于2014年10月17日开启测试，2015年5月20日进行公测并在6月3日正式发布。游戏背景：宇宙里有两只空虚寂寞的神，一个红的，一个蓝的，俩人无聊就说要下下国际象棋来比试比试。
神仙消磨时光的掐架怎么只会用平凡的棋子，于是，他们俩合伙绑架了宇宙各个位面的许多英雄来做棋子，命他们在两位大神创造的棋盘世界中厮杀，而这些英雄全部来自暴雪公司。
于是这些英雄们，就被迫分成红蓝两个阵营，为了天梯积分，展开了永无休止的战斗。",
                "img"=>"./img/img3",
                "baike"=>"https://baike.baidu.com/item/%E9%A3%8E%E6%9A%B4%E8%8B%B1%E9%9B%84"),
    "英雄联盟"=>array("name"=>"英雄联盟",
                "text"=>"《英雄联盟》(简称LOL)是由美国拳头游戏(Riot Games)开发、中国大陆地区腾讯游戏代理运营的英雄对战MOBA竞技网游。
游戏里拥有数百个个性英雄，并拥有排位系统、符文系统等特色养成系统。
《英雄联盟》还致力于推动全球电子竞技的发展，除了联动各赛区发展职业联赛、打造电竞体系之外，每年还会举办“季中冠军赛”“全球总决赛”“All Star全明星赛”三大世界级赛事，获得了亿万玩家的喜爱，形成了自己独有的电子竞技文化。在符文之地，魔法就是一切。
在这里，魔法不只是一种神秘莫测的能量概念。它
是实体化的物质，可以被引导、成形、塑造和操作。符文之地的魔法拥有自己的自然法则。源生态魔法随机变化的结果改变了科学法则。
符文之地有数块大陆，不过所有的生命都集中在最大魔法大陆——瓦罗兰。瓦罗兰大陆居于符文之地中心，是符文之地面积最大的大陆。
被祝福的符文之地上有大量源生态魔法能量，而此地居民可以触及其中的能量。符文之地的中心区域集中了数量巨大的源生态魔法能量，这些地方都是水晶枢纽的理想位置。水晶枢纽可以将源生能量塑形为自身实体化的存在。此外，水晶枢纽还可以成为能量车间，为需要魔法能量的建筑供能。水晶枢纽遍布符文之地，但最大的水晶枢纽都坐落在瓦罗兰大陆",
                "img"=>"./img/img1",
                "baike"=>"https://baike.baidu.com/item/%E8%8B%B1%E9%9B%84%E8%81%94%E7%9B%9F/4615671"),
    "怪物猎人世界"=>array("name"=>"怪物猎人世界","text"=>"由卡普空开发团队采用MT Framework引擎开发，制作时间达四年之久。 [1] 
2018年8月13日，腾讯Wegame发布公告，称“因WeGame平台发行的《怪物猎人 世界》部分游戏内容未完全符合政策法规要求，相关政府管理部门接到大量举报，该游戏相应运营资质文件现在已被取消。应主管部门要求，现执行下架整改，停止游戏售卖。本代怪物猎人发生了诸多进化，玩法与画面都有非常巨大的进步，游戏最多支持16人联机社区，4人联机狩猎。在游戏中玩家将扮演一位猎人，需要探索一片新发现的神秘土地，关于这片土地人们知之甚少，所以将这片大陆称为“新世界”。猎人们必须利用他们的聪明才智和个人能力才能在激烈、变化多端的战斗中存活下来，并且最终成为终极猎人。",
                "img"=>"./img/img4","baike"=>"https://baike.baidu.com/item/%E6%80%AA%E7%89%A9%E7%8C%8E%E4%BA%BA%EF%BC%9A%E4%B8%96%E7%95%8C?fromtitle=%E6%80%AA%E7%89%A9%E7%8C%8E%E4%BA%BA%E4%B8%96%E7%95%8C&fromid=14022620"));
//获取前端传递的参数
$name=$_GET['name'];
$game=$games[$name];
/*print_r($game);*/
//拼成字符串返回
echo $game['name'];
echo '|';
echo $game['text'];
echo "|";
echo $game["img"];
echo "|";
echo $game["baike"];
?>